import streamlit as st

st.title("🍳 ร้านอาหารตามสั่งของน้องซอล")

st.write("🛒 เลือกรายการอาหาร")

# จำนวนอาหาร
กะเพราหมูสับ = st.number_input("กะเพราหมูสับ 40 บาท", 0, 10, 0)
กะเพราหมูกรอบ = st.number_input("กะเพราหมูกรอบ 50 บาท", 0, 10, 0)
หมูปิ้ง = st.number_input("หมูปิ้งโบราณ 5 บาท", 0, 10, 0)
ซาลาเปา = st.number_input("ซาลาเปาไส้หมู 25 บาท", 0, 10, 0)
ข้าวหมูหวาน = st.number_input("ข้าวหมูหวาน 40 บาท", 0, 10, 0)
ข้าวหมูกระเทียม = st.number_input("ข้าวหมูกระเทียม 40 บาท", 0, 10, 0)
ข้าวขาหมู = st.number_input("ข้าวขาหมู 45 บาท", 0, 10, 0)
ข้าวหมูแดง = st.number_input("ข้าวหมูแดง 40 บาท", 0, 10, 0)

# คำนวณราคา
ราคา = (
    กะเพราหมูสับ * 40 +
    กะเพราหมูกรอบ * 50 +
    หมูปิ้ง * 5 +
    ซาลาเปา * 25 +
    ข้าวหมูหวาน * 40 +
    ข้าวหมูกระเทียม * 40 +
    ข้าวขาหมู * 45 +
    ข้าวหมูแดง * 40
)

# ส่วนลด
ส่วนลด = 0

if ราคา >= 200:
    ส่วนลด = ราคา * 10 / 100

ราคาสุทธิ = ราคา - ส่วนลด

# แสดงผล
st.write("รวมราคา =", ราคา, "💸 บาท")
st.write("ส่วนลด =", ส่วนลด, "🏷️ บาท")
st.write("ราคาสุทธิ =", ราคาสุทธิ, "💰 บาท")

# ปุ่มยืนยัน
if st.button("ยืนยันการสั่งซื้อ ⚠️"):
    st.success("สั่งซื้อสำเร็จ ✅")
